[
    {
        "product_id": "99105003",
        "reviews": [
            {
                "opinion_id": "19043025",
                "author": "Unknown",
                "recommendation": "",
                "score": 0.0,
                "content": "Laptop Apple MacBook Air M1 cieszy się wysokim uznaniem wśród użytkowników, którzy chwalą jego lekkość, szybkość działania oraz wysoką jakość wykonania. Użytkownicy doceniają także długi czas pracy na baterii oraz zgranie z innymi produktami Apple. Mimo pewnych ograniczeń wynikających z braku standardowych portów, ogólne wrażenie jest bardzo pozytywne.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "",
                "purchase_date": ""
            },
            {
                "opinion_id": "14268101",
                "author": "s...3",
                "recommendation": "",
                "score": 5.0,
                "content": "Laptop jest perfekcyjny, tylko nie za bardzo mi pasuje pod względem inżynierskich program typu Autocad, Robot itd.\nJak kupujecie go w celu pracy w tych programach to będzie nie najlepszy pomysł ze kupować ten laptop. We wszystkim innym nie mogę się nacieszyć - szybki, lekki, nie nagrzewa się, cichy i piękny :)",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-10 18:42:54",
                "purchase_date": "2021-03-10 22:32:01"
            },
            {
                "opinion_id": "15147658",
                "author": "b...1",
                "recommendation": "",
                "score": 4.5,
                "content": "Za tą cenę - nie ma równych na rynku🔝. \nPerfekcyjnie wykończony design, bezkonkurencyjny procesor(świetnie radzi sobie ze wszystkimi wymaganiami, osobiście dla mnie, w marketingu i reklamie), dobry experience.\nPolecam od całego serca!👍🏻",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-10-30 17:23:04",
                "purchase_date": "2021-09-30 07:32:20"
            },
            {
                "opinion_id": "14228418",
                "author": "s...e",
                "recommendation": "",
                "score": 5.0,
                "content": "Jakość wykonania na najwyższym poziomie, pojemna bateria, każdego dnia używam go nonstop w godzinach 12-16. Duży gładzik dzięki któremu nie ma potrzeby kupowania myszki, jakosc audio rowniez na wysokim poziomie, pisanie sprawia przyjemność",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-04 00:45:49",
                "purchase_date": "2021-03-17 10:32:40"
            },
            {
                "opinion_id": "13786487",
                "author": "Tomasz",
                "recommendation": "",
                "score": 5.0,
                "content": "Jeszcze przed Sylwestrem 2020 kupiłem nowy model MacBooka Air (szary z 16GB RAM). Na dostawę z Cortland czekałem tylko tydzień, może miałem szczęście. Jest naprawdę ładny (zwłaszcza wyświetlacz w porównaniu ze starym MacBookiem Air z 2015), jakość wykonania aluminiowej obudowy, bardzo wygodna podświetlana klawiatura (chociaż przyzwyczaiłem się do większego skoku klawiszy), wielki i precyzyjny gładzik (warto nauczyć się obsługi gestów, jak np. przewijanie stron 2 palcami) - są w tym modelu bez zarzutu.  Dźwięk także bardzo dobry, czysty i znacznie głośniejszy niż w ASUSie ZenBook sprzed paru lat. Szkoda, że nie da się na nowym MacBooku zainstalować systemu Windows na wydzielonej partycji (podobno da się na maszynie wirtualnej Parallels). Minusem jest mało portów (tylko 2 USB typu C, w tym do ładowania, i wyjście na słuchawki) oraz brak czytnika kart pamięci (w starym modelu pozwalał tanio zwiększyć pamięć na pliki). Sprawę załatwia zgrabny kwadratowy hub od GreenCella (może lepiej nie podłączać przez niego ładowania, chociaż można, ale myszki, dyski zewnętrzne na USB i wyjście HDMI na zewnętrzny monitor - działają). Nie wykorzystywałem dotąd bardzo obciążających system programów (typu Final Cut Pro), ale aplikacje systemowe (Zdjęcia, Muzyka, Safari) oraz inne często używane (Microsoft *****, PowerPoint, Excel, Adobe Reader czy Google Chrome) uruchamiają się bardzo szybko a laptop działa bez szumu wentylatorów (których brak) i czasami jest tylko trochę cieplejszy... Wbrew narzekaniom paru youtuberów, obraz z kamerki nawet starego MacBooka Air z 2015 był ładny, jasny i wyraźny w porównaniu z innymi uczestnikami lekcji online (aplikacja Teams na MacOS). W nowym modelu jest oczywiście nie gorsza kamera niż w starym. Bateria starcza na 10 godzin pracy czy nawet więcej (przy przyciemnionym wyświetlaczu i bez wi-fi). System operacyjny MacOS 11 Big Sur jest intuicyjny w obsłudze, ładny graficznie i stabilny (świetnie sprawdza się np. Time Machine). W ogóle nie gram na komputerze, więc na dostępności najnowszych gier w sklepie AppStore mi nie zależy. Jako wieloletni użytkownik Windowsów wszelakich nie mogłem jednak przyzwyczaić się do paru różnic obu systemów, jak brak na klawiaturze MacBooka Delete, od razu też przestawiłem miejscami klawisze Command i Option, aby wygodniej wstawiać w tekście polskie znaki. Gesty gładzika dopiero poznaję, wolę używać zewnętrznej myszki, a to jest dosyć kłopotliwe, bo wymaga adaptera USB C na USB 3.1 albo myszki na Bluetooth. Może z czasem zainwestuję w nowszą mysz, np. od Apple...",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-01-17 11:26:10",
                "purchase_date": ""
            },
            {
                "opinion_id": "14313169",
                "author": "k...k",
                "recommendation": "",
                "score": 5.0,
                "content": "Jako użytkownik systemu windows i laptopów/komputerów na nim opartych od wielu lat muszę powiedzieć, że jakość wykonania tej maszyny to wręcz definicja produktu premium. Aluminiowa obudowa, która się nie w ogóle nie nagrzewa, laptop nie wydaje żadnych dźwięków a system śmiga jak torpeda. Co prawda przyzwyczajenie się do tego, jak pewne rzeczy są konfigurowane/wykorzystywane w MacOS trochę może zająć po latach innych nawyków ale pierwsze wrażenie jest jest piorunujące. Nigdy nie widziałem tak wysokiej jakości obrazu na ekranie laptopa, żyletka. A te kolory... Głośniki też spoko, mają nawet zauważalną głębię co jest dziwnym biorąc pod uwagę jak drobny jest to sprzęt. Jedyny minus jaki w zasadzie zauważyłem to spore ramki wokół ekranu, których w laptopach premium na Windowsie nie ma już od paru lat.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-18 20:07:28",
                "purchase_date": "2021-04-13 23:01:00"
            },
            {
                "opinion_id": "15390962",
                "author": "v...a",
                "recommendation": "",
                "score": 5.0,
                "content": "Super cienki i Super wykonanie! super bateria  i szybkosc wiecej mi nie trzeba :)",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-12-18 09:52:14",
                "purchase_date": "2021-12-05 10:08:38"
            },
            {
                "opinion_id": "14371486",
                "author": "z...p",
                "recommendation": "",
                "score": 5.0,
                "content": "Mac, nic dodać nic ująć. Sprzęt wykonuje komendy w mgnieniu oka, piękny głęboki obraz z inteligentnym systemem przechodzenia w tryb nocny (można oczywiście wyłączyć) potężna bateria, fantastyczny, głęboki dźwięk z usadowionych obok klawiatury głośniczków, łączność z internetem po wifi niezawodna, mikrofon świetnie zbiera, kamera internetowa mogłaby być lepsza, bo w porównaniu z iPhonem prezentuje się licho, ale standard jest wciąż profesjonalny.\nMinusy - brak standardowych wejść, od razu trzeba kupić adapter dla wszystkich potrzebnych narzędzi, SD USB HDMI itd.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-28 10:22:44",
                "purchase_date": "2021-04-16 17:00:40"
            },
            {
                "opinion_id": "13816722",
                "author": "m...c",
                "recommendation": "",
                "score": 5.0,
                "content": "To mój pierwszy MacBook. Decyzję o zmianie komputera osobistego z windowsem na komputer z MacOS podjąłem przy okazji kilkumiesięcznego użytkowania flagowego smartfona z androidem i powrocie do iPhone. \nDostęp do plików, multimediów i danych jest rewelacyjny w połączeniu z iCloud.\nMacbook Air M1 jest wykonany z bardzo dobrej jakości materiałów. Jest całkowicie bezgłośny (nie posiada wentylatorów) a przy tym bardzo chłodny. Uważam, że jego cena jest adekwatna do tego co oferuje.\nPolecam.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-01-21 20:31:49",
                "purchase_date": "2021-01-12 22:35:45"
            },
            {
                "opinion_id": "14327419",
                "author": "d...h",
                "recommendation": "",
                "score": 5.0,
                "content": "Sprzęt idealny",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-21 07:15:46",
                "purchase_date": "2021-04-06 23:09:40"
            },
            {
                "opinion_id": "18701569",
                "author": "e...z",
                "recommendation": "",
                "score": 3.0,
                "content": "To mój pierwszy  kontakt  z produktem firmy Apple. Tak jak czytałem o jakości  dźwięku i obrazu  ,intuicyjności  systemu tak faktycznie  byłem  mile zaskoczony. Nie mniej nie obyło się bez momentów  rozczarowania.Amatorsko zajmuję  się  fotografią  i niestety tutaj zaczynają się schody.\nNiektórych  programów  do obróbki  zdjęć  nie można  wgrać. Oglądanie własnych  filmów  video z wakacji na tv z androidem poprostu  nie odtworzysz.Zdarza się,  że Macbook się zawiesza i mocno grzeje. Mówiąc  wprost  super gadżety  to oglądania filmów z aplikacji, słuchani muzyki, przeglądania stron ale nie dla amatora fotografii.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-06-03 12:00:41",
                "purchase_date": "2024-04-02 21:08:22"
            }
        ]
    },
    {
        "product_id": "213123",
        "reviews": []
    },
    {
        "product_id": "114700014",
        "reviews": [
            {
                "opinion_id": "18903150",
                "author": "Unknown",
                "recommendation": "",
                "score": 0.0,
                "content": "Dyson V12 Detect Slim Absolute zyskał wysokie uznanie wśród użytkowników, którzy doceniają lekkość, moc i funkcjonalność urządzenia. Wielu użytkowników podkreśla innowacyjne podświetlenie, które ułatwia dostrzeganie zanieczyszczeń, oraz różnorodność dołączonych końcówek. Choć niektórzy zgłaszają drobne problemy, ogólne wrażenie jest niezwykle pozytywne, a odkurzacz jest uważany za rewelacyjny wybór.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "",
                "purchase_date": ""
            },
            {
                "opinion_id": "18616837",
                "author": "i...d",
                "recommendation": "",
                "score": 5.0,
                "content": "Bardzo długo zastanawiałam się nad wyborem między Dysonem V11, V12 i V15 oraz nad Dreame R20, kilka dni czytałam opinie, oglądałam recenzje, oglądałam w sklepach itp. Wybór padł na Dysona V12 i to był najlepszy wybór z możliwych, obawiałam się, że na mój dom 100m² nie wystarczy baterii lub że trzeba będzie często opróżniać pojemnik (mam długowłosego psa i kota, pełno żwirku i piachu z dworu), ale nic z tych rzeczy, po odkurzeniu całego domu zostaje mi jeszcze jakieś 60% baterii i pojemnik mogę spokojnie opróżniać co 4 sprzątania, odkurzam tylko na trybie ECO i moc jest super, koci żwirek czy inne rzeczy wciąga bez najmniejszego problemu, laserowa końcówka jest świetna i tylko jej używam. Nie wybrałam pozostałych odkurzaczy ponieważ Dreame R20 podobno szybko traci moc baterii i trzeba ją wymieniać a kosztuje około 800zl w dodatku szczotka po około pół roku często nie łączy - znalazłam kilka takich przypadków, podobno jest też tak ciężki że mdleje ręka. V15 nie wybrałam ze względu na ciągłe trzymanie przycisku i wagę, podobno też jest bardzo ciężki i ręka boli, tak samo z V11 - duża waga, trzymanie przycisku. Reasumując V12 jest super lekki, zwrotny, pojemnik starcza mi na sprzątanie 100m² około 4 razy, baterii po jednym sprzątaniu zostaje mi około 60%, posiada bardzo dużo końcówek, nie trzeba trzymać przycisku. Dla mnie rewelacja, polecam!",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-05-01 09:19:31",
                "purchase_date": "2024-04-15 11:45:49"
            },
            {
                "opinion_id": "18536064",
                "author": "A...t",
                "recommendation": "",
                "score": 5.0,
                "content": "Długo szukałam, sporo filmików na YT o ujrzałam. Zakup super. To mój trzeci odkurzać pionowy, ale podświetlenie przy pracy odkurzacza to game changer. Polecam ten model v12. Super lekki",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-03-29 11:14:23",
                "purchase_date": "2024-03-17 13:45:25"
            },
            {
                "opinion_id": "17516357",
                "author": "g...a",
                "recommendation": "",
                "score": 5.0,
                "content": "Fantastyczny sprzęt, bardzo mocny, lekki i odpowiedni do każdego domu i mieszkania",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2023-05-17 10:52:54",
                "purchase_date": "2023-05-12 09:57:19"
            },
            {
                "opinion_id": "18499460",
                "author": "j...k",
                "recommendation": "",
                "score": 4.0,
                "content": "Odkurzacz spełnia wymagania",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-03-18 08:42:26",
                "purchase_date": "2024-03-10 15:49:13"
            },
            {
                "opinion_id": "18457506",
                "author": "n...2",
                "recommendation": "",
                "score": 5.0,
                "content": "Produkt super",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-03-04 08:34:36",
                "purchase_date": "2024-02-17 16:31:32"
            },
            {
                "opinion_id": "19255075",
                "author": "a...r",
                "recommendation": "",
                "score": 4.5,
                "content": "ok",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-12-03 11:57:09",
                "purchase_date": "2024-11-27 21:27:18"
            },
            {
                "opinion_id": "16459243",
                "author": "l...i",
                "recommendation": "",
                "score": 5.0,
                "content": "Mam w domu psa który zrzuca non stop dużo sierści. Potrzebowałem odkurzacz który sobie z tym poradzi i zarówno podłoga jak i łóżko będą czyste. Ten sobie doskonale poradził. W trybie turbo nie ma zabrudzenia którego by nie wciągnął. Końcówki są zaprojektowane w taki sposób żeby włosy i sierść się nie wplatywala. Jedyna wada to opróżnianie pojemnika na brud. Często trzeba sobie pomagać palcem i sierść która się przyczepi do zawiasów należy wyjąc ręcznie",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2022-08-26 11:17:23",
                "purchase_date": "2022-08-21 20:00:27"
            },
            {
                "opinion_id": "19491359",
                "author": "m...y",
                "recommendation": "",
                "score": 4.5,
                "content": "Odkurzacz pionowy Dyson V12 Detect Slim Absolute jest takim urzadzeniem na które czekałam, jest lekki, świetnie zbiera, łatwy w obsłudze , posiada super rozwiązanie  z opróżnianiem pojemnika ze śmieciami, a szczotka z laserem może przyprawić o zawrót głowy...pokazuje z jaka ilością nieczystości zmagamy się przy odkurzaniu np. podłogi a gołym okiem wydawało się , że jest czysto. Zdecydowanie polecam , miałam juz inne odkurzacze renomowanych firm - były ok, ale ten jest rewelacyjny.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2025-03-05 09:24:58",
                "purchase_date": "2025-02-20 21:59:48"
            },
            {
                "opinion_id": "19356621",
                "author": "j...c",
                "recommendation": "",
                "score": 4.5,
                "content": "Całkiem dobre wykonanie. Moc ssania na wystarczającym poziomie. Optymalna liczba końcówek i ich funkcjonalność. Relatywnie cicha praca i niska waga produktu. \nWyświetlanie liczby i rodzaju wciąganych śmieci - dla mnie osobiście to niepotrzebny bajer. \nW tej cenie może oczekiwałbym trochę bardziej wydajnej baterii. Te 60 min to tylko w trybie ECO, gdzie jest słabe wciąganie. Realnie w trybie auto wychodzi ok. 35 minut.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2025-01-08 11:36:06",
                "purchase_date": "2024-12-31 11:55:21"
            },
            {
                "opinion_id": "19467106",
                "author": "j...i",
                "recommendation": "",
                "score": 5.0,
                "content": "Bardzo dobry odkurzacz. Zastanawiałem się nad Dreame. Użytkuję jednego Dysona V12 od trzech lat i do drugiego mieszkania chciałem coś tańszego. Podobał mi się Dreame Z20. Byłem w salonie, oglądałem, fajny ale jednak jak weźmie się Dysona do ręki, tym bardziej że jestem przyzwyczajony to jest różnica, jest lekki, zwrotny, pojemnik szybko się opróżnia, ładowarka na wieszaku. Wszystko jak powinno być. Sprząta pięknie.",
                "pros": [],
                "cons": [],
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2025-02-21 13:42:41",
                "purchase_date": "2025-02-15 22:57:38"
            }
        ]
    }
]