[
    {
        "product_id": "16524500",
        "name": "Bayer Obroża FORESTO dla dużych psów powyżej 8kg",
        "reviews": [
            {
                "opinion_id": "19032101",
                "author": "Unknown",
                "recommendation": "No recommendation",
                "score": 0.0,
                "content": "Obroża Foresto cieszy się wysoką oceną wśród użytkowników, którzy doceniają jej skuteczność w ochronie psów przed kleszczami. Wiele osób potwierdza, że obroża sprawdza się nawet w trudnych warunkach, jak spacery w lesie czy w rejonach z dużą ilością kleszczy. Choć część użytkowników zwraca uwagę, że obroża nie zawsze działa według oczekiwań na psy z dłuższym włosem, ogólna tendencja wskazuje na dużą satysfakcję z produktu. Wskazano również na pewne problemy związane z zamówieniami, ale opinie na temat samej obroży są głównie pozytywne.",
                "pros": "Skuteczność, Długość działania, Bezzapachowość, Wodoodporność",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "",
                "purchase_date": ""
            },
            {
                "opinion_id": "11852176",
                "author": "Użytkownik Ceneo",
                "recommendation": "Polecam",
                "score": 4.5,
                "content": "Obroża Foresto całkowicie zabezpiecza psa przed kleszczami. Stosuję ją od kilku lat i nigdy nie znalazłam żadnego kleszcza na psach, mimo tego że się często kąpią w rzece i biegają po podmokłym terenie, po lesie, łąkach i zadrzewionej działce. Polecam. Mimo wysokiej ceny i tak się bardziej opłaca niż krople.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2020-03-05 09:54:56",
                "purchase_date": "2020-03-02 11:14:36"
            },
            {
                "opinion_id": "16049837",
                "author": "jeziorna3",
                "recommendation": "Polecam",
                "score": 4.5,
                "content": "Obroża Foresto to świetne rozwiązanie zabezpieczające psa przed kleszczami, nie uczula, nie wydziela przykrego zapachu, długo spełnia swoją rolę.\nNie zabezpiecza, co prawda przed wbijaniem się kleszcza w skore, ale szybko go uśmierca i „ususzony” insekt odpada.\nPolecam, szczególnie psom alergicznym, starszym i wrażliwym np. na krople. Foresto to najbezpieczniejsze i najmniej szkodliwe dla zwierzęcia rozwiązanie.",
                "pros": "antyalergiczny, bardzo dobry, bezpieczna dla zwierzęcia, bezwonna, bezzapachowa, długie działanie, elastyczna - odporna na temperatury, jakość, lekka, łatwa w użyciu, łatwo się ją zakłada/zdejmuje, łatwość w użyciu, nie ma drażniącego zapachu, odporna na uszkodzenia, prosta w obsłudze, trwałość, uważam za zaletę, wodoodporna, wodoodpornosc, wodoodpornosc, efektywnosc, wygląd, wystarczająco długa by dopasować do szyj, wytrzymała",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2022-05-06 07:47:13",
                "purchase_date": "2022-05-04 09:10:03"
            },
            {
                "opinion_id": "14116371",
                "author": "m...z",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Od lat kupuję obroże Foresto dla moich psów .Uważam , że są najskuteczniejsze , psy noszą je prawie przez cały rok . Codzienne chodzimy do lasu , gdzie kleszczy jest najwięcej, zdarza się kleszcz przyczepi się do skóry , ale zaraz odpada, preparat z obroży rozchodzi się po całym ciele. Polecam :)",
                "pros": "None",
                "cons": "wygląd",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-03-15 12:11:40",
                "purchase_date": "2021-03-14 15:39:36"
            },
            {
                "opinion_id": "18566137",
                "author": "aureliasosnowska*****",
                "recommendation": "No recommendation",
                "score": 3.0,
                "content": "Obroża na psa z krótką sierścią - jack Russell terier działa super.  Mieszkamy przy lesie i pies w okresie od wiosny łapał czesto kleszcze,  natomiast na shitzu z dłuższym włosem niestety nie działa wcale. Pies jak miał kleszcze tak ma. Nic nie daje ciaśniej jak to mówią weterynarze . Poprostu nie nadaje się dla piesków z dłuższym włosem.",
                "pros": "prosta w obsłudze",
                "cons": "jakość, trwałość, wygląd",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-04-11 10:05:30",
                "purchase_date": "2024-03-29 23:19:28"
            },
            {
                "opinion_id": "14309007",
                "author": "b...n",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Używam tych obróżek od 8 lat. Spełniają swoją funkcję, należy jednak pamiętać, że działają po wbiciu się kleszcza. Nie mają działania odstraszającego. Po spacerze oglądam moją Goldenkę i zbieram ruszające się kleszcze (czasem wałkiem do usuwania włosów z odzieży).",
                "pros": "jakość, trwałość, wygląd",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-17 06:17:23",
                "purchase_date": "2021-03-29 10:18:47"
            },
            {
                "opinion_id": "16115461",
                "author": "m...k",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Obroża spełnia swoją funkcję. Stosujemy ją naszemu psu od paru lat gdyż ani tabletki ani płyny nie były skuteczne a obroża praktycznie nie przepusci żadnemu kleszczowi.Jesli już jakiś się znajdzie to nie wbija się.",
                "pros": "antyalergiczny, bardzo dobry, bezpieczna dla zwierzęcia, bezwonna, bezzapachowa, długie działanie, elastyczna - odporna na temperatury, jakość, lekka, łatwa w użyciu, łatwo się ją zakłada/zdejmuje, łatwość w użyciu, nie ma drażniącego zapachu, odporna na uszkodzenia, prosta w obsłudze, trwałość, uważam za zaletę, wodoodporna, wodoodpornosc, wodoodpornosc, efektywnosc, wygodna, wystarczająco długa by dopasować do szyj, wytrzymała",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2022-05-22 22:50:07",
                "purchase_date": "2022-04-22 16:34:04"
            },
            {
                "opinion_id": "17506874",
                "author": "j...9",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Od pięciu lat stosujemy Bayer Foresto Obroża Przeciw Pchłom I Kleszczom dla Psów.\nPies praktycznie przebywa cały czas na powietrzu. Do tej pory skuteczna ochrona.Oby jak najdłużej.Trochę drogo sprzedajecie",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2023-05-14 23:16:25",
                "purchase_date": "2023-04-17 19:56:27"
            },
            {
                "opinion_id": "12270617",
                "author": "Użytkownik Ceneo",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Obroża jest wspaniała, nasz cockerek już nie łapie kleszczy, nie wbijają mu się mimo że mieszkamy blisko lasu gdzie jest ich troche i jest bardzo odporna wystarczy na kilka miesięcy. Polecam",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2020-04-27 19:10:26",
                "purchase_date": "2020-04-15 08:47:51"
            },
            {
                "opinion_id": "14564256",
                "author": "Marek",
                "recommendation": "Nie polecam",
                "score": 1.0,
                "content": "Obroża założona na młodym owczarku podhalańskim 45kg. Po miesiącu 2 kleszcze wpite i opite usunięte. Po kontakcie z weterynarzem co z tym robić. Założyć ciaśniej bo pewnie zbyt luźno (chociaż wolnego było niby dwa palce i nie więcej). Po 4 dniach kolejne dwa kleszcze i to przy samej obroży może ze 4 cm od niej... na szyi od spodu... No i na koniec zrobiło się gorąco 27st C. i obroża przy skórze założona zadziałała jak za ciasno założony zegarek na rękę pies w tym miejscu spocony jak mysz zdjąłem ten bubel i każdemu odradzam zakup. Może sprawdza się na małych psach z krótkim włosem na moim Argosie się nie sprawdziła. Zaufałem temu badziewiu i teraz nie wiadomo czy mój piesio nie przypłaci tego jakąś chorobą. Już nie mówię że nie jest to tanie rozwiązanie wygląda słabo i co najważniejsze NIE DZIAŁA.",
                "pros": "None",
                "cons": "jakość, prosta w obsłudze, trwałość, wygląd",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-06-07 09:13:10",
                "purchase_date": "2021-03-05 13:54:12"
            },
            {
                "opinion_id": "16007035",
                "author": "Elladan56",
                "recommendation": "Nie polecam",
                "score": 1.0,
                "content": "Nie wiem co mam sądzić o produkcie bo nie otrzymałem do tej pory swojego zakupu pomimo tego, że dokonałem zakupu 09.04.2022.. Oczywiście sprzedawca wymiguje się że to wina inpostu ale sądząc po opiniach to oczywiście ich wina bo przecież to nie może być przypadek przy takich ilościach negatywnych komentarzy. Kontaktu z nimi brak. Dopiero po tym jak napisałem, że zgłoszę sprawę na policję to do mnie zadzwonili ale oczywiście gadka, że to wina inpostu... więc ja jako klient muszę dociekać kogo to była wina... ***** firma naprawdę. No to dociekałem. Inpost mówi, że paczka była źle zaadresowana więc ją wycofali do nadawcy. Telefonicznie poprosiłem o stanowisko w tej sprawie firmę karmyzwierzaki.pl i o dowód w postaci maila, oczywiście pan obiecał że wszystkie szczegóły opisze maillowo ale nawet tego nie potrafią zrobić pomimo że napisałem do nich ponownie maila co ma być w nim zawarte to nie otrzymałem nic od 2 dni... i możesz mówić i tłumaczyć, że inpost mi przekazał informację, że źle zaadresowali przesyłkę to ***** nie... ale możemy panu obroże wysłać jeszcze raz nie ma problemu... i to hasło się powtarza cały czas, telefonicznie jak zadzwonili do mnie pierwszy raz oraz mailowo. Napisałem im w takim razie że poproszę o ponowne wysłanie skoro nie ma problemu. To było 6 dni temu, ale przecież oni twierdzą, że od razu wysyłają wszystko tego samego lub następnego dnia i to wszystko wina inpostu... szkoda, że nie dostałem żadnego maila od inpostu, ani z ceneo, że cokolwiek się dzieje w tym kierunku... dla mnie za nie długo sprawa trafia na policję bo to jest oszukiwanie ludzi. I jako ceneo też powinniście coś z takimi ludźmi zrobić, ja już na 100% nie zamówię przez waszą stronę niczego i odradzę to znajomym i rodzinie bo to jest nie poważne. Kontakt ze sklepem przez waszą stronę nie działa... Załączam screeny jakby ktoś miał wątpliwości.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2022-04-25 23:44:53",
                "purchase_date": "2022-04-09 21:35:41"
            }
        ]
    }
]