[
    {
        "product_id": "114700014",
        "name": "Dyson V12 Detect Slim Absolute",
        "reviews": [
            {
                "opinion_id": "18903150",
                "author": "Unknown",
                "recommendation": "No recommendation",
                "score": 0.0,
                "content": "Dyson V12 Detect Slim Absolute zyskał wysokie uznanie wśród użytkowników, którzy doceniają lekkość, moc i funkcjonalność urządzenia. Wielu użytkowników podkreśla innowacyjne podświetlenie, które ułatwia dostrzeganie zanieczyszczeń, oraz różnorodność dołączonych końcówek. Choć niektórzy zgłaszają drobne problemy, ogólne wrażenie jest niezwykle pozytywne, a odkurzacz jest uważany za rewelacyjny wybór.",
                "pros": "Moc, Lekkość, Innowacyjne Podświetlenie, Różnorodność Końcówek, Prosta Obsługa",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "",
                "purchase_date": ""
            },
            {
                "opinion_id": "18616837",
                "author": "i...d",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Bardzo długo zastanawiałam się nad wyborem między Dysonem V11, V12 i V15 oraz nad Dreame R20, kilka dni czytałam opinie, oglądałam recenzje, oglądałam w sklepach itp. Wybór padł na Dysona V12 i to był najlepszy wybór z możliwych, obawiałam się, że na mój dom 100m² nie wystarczy baterii lub że trzeba będzie często opróżniać pojemnik (mam długowłosego psa i kota, pełno żwirku i piachu z dworu), ale nic z tych rzeczy, po odkurzeniu całego domu zostaje mi jeszcze jakieś 60% baterii i pojemnik mogę spokojnie opróżniać co 4 sprzątania, odkurzam tylko na trybie ECO i moc jest super, koci żwirek czy inne rzeczy wciąga bez najmniejszego problemu, laserowa końcówka jest świetna i tylko jej używam. Nie wybrałam pozostałych odkurzaczy ponieważ Dreame R20 podobno szybko traci moc baterii i trzeba ją wymieniać a kosztuje około 800zl w dodatku szczotka po około pół roku często nie łączy - znalazłam kilka takich przypadków, podobno jest też tak ciężki że mdleje ręka. V15 nie wybrałam ze względu na ciągłe trzymanie przycisku i wagę, podobno też jest bardzo ciężki i ręka boli, tak samo z V11 - duża waga, trzymanie przycisku. Reasumując V12 jest super lekki, zwrotny, pojemnik starcza mi na sprzątanie 100m² około 4 razy, baterii po jednym sprzątaniu zostaje mi około 60%, posiada bardzo dużo końcówek, nie trzeba trzymać przycisku. Dla mnie rewelacja, polecam!",
                "pros": "dużo końcówek, lekki, poręczny, przycisk zasilania, wyświetlacz, wytrzymała bateria, zwrotny",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-05-01 09:19:31",
                "purchase_date": "2024-04-15 11:45:49"
            },
            {
                "opinion_id": "18536064",
                "author": "A...t",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Długo szukałam, sporo filmików na YT o ujrzałam. Zakup super. To mój trzeci odkurzać pionowy, ale podświetlenie przy pracy odkurzacza to game changer. Polecam ten model v12. Super lekki",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-03-29 11:14:23",
                "purchase_date": "2024-03-17 13:45:25"
            },
            {
                "opinion_id": "17516357",
                "author": "g...a",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Fantastyczny sprzęt, bardzo mocny, lekki i odpowiedni do każdego domu i mieszkania",
                "pros": "dużo końcówek, poręczny, przycisk zasilania, wyświetlacz",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2023-05-17 10:52:54",
                "purchase_date": "2023-05-12 09:57:19"
            },
            {
                "opinion_id": "18499460",
                "author": "j...k",
                "recommendation": "Polecam",
                "score": 4.0,
                "content": "Odkurzacz spełnia wymagania",
                "pros": "dużo końcówek, poręczny, przycisk zasilania, wyświetlacz",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-03-18 08:42:26",
                "purchase_date": "2024-03-10 15:49:13"
            },
            {
                "opinion_id": "18457506",
                "author": "n...2",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Produkt super",
                "pros": "dużo końcówek, lekki, poręczny, przycisk zasilania, wyświetlacz",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-03-04 08:34:36",
                "purchase_date": "2024-02-17 16:31:32"
            },
            {
                "opinion_id": "19255075",
                "author": "a...r",
                "recommendation": "Polecam",
                "score": 4.5,
                "content": "ok",
                "pros": "dużo końcówek, poręczny, przycisk zasilania, wyświetlacz",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-12-03 11:57:09",
                "purchase_date": "2024-11-27 21:27:18"
            },
            {
                "opinion_id": "16459243",
                "author": "l...i",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Mam w domu psa który zrzuca non stop dużo sierści. Potrzebowałem odkurzacz który sobie z tym poradzi i zarówno podłoga jak i łóżko będą czyste. Ten sobie doskonale poradził. W trybie turbo nie ma zabrudzenia którego by nie wciągnął. Końcówki są zaprojektowane w taki sposób żeby włosy i sierść się nie wplatywala. Jedyna wada to opróżnianie pojemnika na brud. Często trzeba sobie pomagać palcem i sierść która się przyczepi do zawiasów należy wyjąc ręcznie",
                "pros": "dużo końcówek, poręczny, przycisk zasilania, wyświetlacz",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2022-08-26 11:17:23",
                "purchase_date": "2022-08-21 20:00:27"
            },
            {
                "opinion_id": "19491359",
                "author": "m...y",
                "recommendation": "Polecam",
                "score": 4.5,
                "content": "Odkurzacz pionowy Dyson V12 Detect Slim Absolute jest takim urzadzeniem na które czekałam, jest lekki, świetnie zbiera, łatwy w obsłudze , posiada super rozwiązanie  z opróżnianiem pojemnika ze śmieciami, a szczotka z laserem może przyprawić o zawrót głowy...pokazuje z jaka ilością nieczystości zmagamy się przy odkurzaniu np. podłogi a gołym okiem wydawało się , że jest czysto. Zdecydowanie polecam , miałam juz inne odkurzacze renomowanych firm - były ok, ale ten jest rewelacyjny.",
                "pros": "dużo końcówek, poręczny, przycisk zasilania, wyświetlacz",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2025-03-05 09:24:58",
                "purchase_date": "2025-02-20 21:59:48"
            },
            {
                "opinion_id": "19356621",
                "author": "j...c",
                "recommendation": "Polecam",
                "score": 4.5,
                "content": "Całkiem dobre wykonanie. Moc ssania na wystarczającym poziomie. Optymalna liczba końcówek i ich funkcjonalność. Relatywnie cicha praca i niska waga produktu. \nWyświetlanie liczby i rodzaju wciąganych śmieci - dla mnie osobiście to niepotrzebny bajer. \nW tej cenie może oczekiwałbym trochę bardziej wydajnej baterii. Te 60 min to tylko w trybie ECO, gdzie jest słabe wciąganie. Realnie w trybie auto wychodzi ok. 35 minut.",
                "pros": "dużo końcówek, lekki, poręczny, przycisk zasilania, zwrotny",
                "cons": "wyświetlacz, wytrzymała bateria",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2025-01-08 11:36:06",
                "purchase_date": "2024-12-31 11:55:21"
            },
            {
                "opinion_id": "19467106",
                "author": "j...i",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Bardzo dobry odkurzacz. Zastanawiałem się nad Dreame. Użytkuję jednego Dysona V12 od trzech lat i do drugiego mieszkania chciałem coś tańszego. Podobał mi się Dreame Z20. Byłem w salonie, oglądałem, fajny ale jednak jak weźmie się Dysona do ręki, tym bardziej że jestem przyzwyczajony to jest różnica, jest lekki, zwrotny, pojemnik szybko się opróżnia, ładowarka na wieszaku. Wszystko jak powinno być. Sprząta pięknie.",
                "pros": "dużo końcówek, poręczny, przycisk zasilania, wyświetlacz",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2025-02-21 13:42:41",
                "purchase_date": "2025-02-15 22:57:38"
            }
        ]
    },
    {
        "product_id": "158655614",
        "name": "Roborock Q8 Max+ Biały",
        "reviews": [
            {
                "opinion_id": "18903435",
                "author": "Unknown",
                "recommendation": "No recommendation",
                "score": 0.0,
                "content": "Użytkownicy Roborock Q8 Max+ Biały są zachwyceni jego skutecznością w odkurzaniu i mopowaniu, chwaląc jednocześnie ostrożność robota w trakcie pracy oraz czytelność aplikacji sterującej. Mimo że niektórzy zauważają, iż urządzenie może mieć problem z odkurzaniem głębszych fug, ogólne wrażenia są bardzo pozytywne, a wiele osób poleca produkt innym.",
                "pros": "Skuteczność, Ostrożność, Intuicyjna aplikacja",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "",
                "purchase_date": ""
            },
            {
                "opinion_id": "18256936",
                "author": "a...k",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Jestem zadowolona. Urządzenie jest bardzo ostrożne, nie obija się. Dobrze odkurza i mopuje. Aplikacja jest bardzo czytelna. Jestem zadowolona.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2023-12-29 11:15:10",
                "purchase_date": "2023-12-17 15:58:44"
            },
            {
                "opinion_id": "18312894",
                "author": "m...r",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Wszystko jest ok, tylko pomiędzy kafelkami, z głębszych fug, nie do końca wciąga, nawet na ustawieniu max+.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-01-17 18:22:07",
                "purchase_date": "2024-01-10 11:31:21"
            },
            {
                "opinion_id": "18843402",
                "author": "b...6",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Robot zdaje egzamin choć używam go bardzo krótko .Odkurza i mopuje bez problemu.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-07-29 08:23:22",
                "purchase_date": "2024-07-24 15:36:58"
            },
            {
                "opinion_id": "18196702",
                "author": "z...5",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "To jest to. Super odkurza i mopuje.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2023-12-11 17:11:10",
                "purchase_date": "2023-11-17 09:11:36"
            },
            {
                "opinion_id": "18256009",
                "author": "l...s",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "wszystko gra i buczy. polecam",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2023-12-29 09:33:26",
                "purchase_date": "2023-12-20 10:30:47"
            },
            {
                "opinion_id": "18255471",
                "author": "b...a",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Super produkt. Polecam.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2023-12-29 08:55:05",
                "purchase_date": "2023-12-20 21:23:32"
            },
            {
                "opinion_id": "18302873",
                "author": "d...4",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Sprawdza się świetnie",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-01-15 10:38:49",
                "purchase_date": "2023-12-18 17:32:30"
            },
            {
                "opinion_id": "18297597",
                "author": "f...5",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Bardzo dobra",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-01-12 10:41:04",
                "purchase_date": "2023-12-24 00:42:45"
            },
            {
                "opinion_id": "18275859",
                "author": "h...a",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Ok",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-01-05 08:50:37",
                "purchase_date": "2023-12-16 15:05:38"
            },
            {
                "opinion_id": "18276758",
                "author": "r...k",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "ok",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-01-05 10:01:14",
                "purchase_date": "2023-12-16 13:53:38"
            }
        ]
    },
    {
        "product_id": "158841627",
        "name": "Apple AirPods Pro 2 gen MagSafe USB-C (MTJV3ZM/A)",
        "reviews": [
            {
                "opinion_id": "19052281",
                "author": "Unknown",
                "recommendation": "No recommendation",
                "score": 0.0,
                "content": "Użytkownicy świadomi wysokiej ceny słuchawek AirPods Pro 2 gen nie żałują swojej decyzji o zakupie. Doceniają doskonałą jakość dźwięku, wyjątkową funkcję aktywnej redukcji hałasu oraz komfort użytkowania. Wysoka kompatybilność z ekosystemem Apple i intuicyjne sterowanie również znajdują wiele pochwał. Choć zdarzają się drobne problemy, ogólne wrażenia są bardzo pozytywne, a wiele osób poleca zakup tych słuchawek.",
                "pros": "Aktywna redukcja hałasu, Jakość dźwięku, Komfort użytkowania, Intuicyjna obsługa",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "",
                "purchase_date": ""
            },
            {
                "opinion_id": "18410583",
                "author": "k...y",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Długo się zastanawiałam czy chcę zainwestować tyle kasy w słuchawki, ale nie żałuję wydanych pieniędzy. \nSłuchawki bardzo dobrze trzymają się w uszach, nie wypadają - ja założyłam sobie gumki XS i są idealne. \nFunckja redukcja redukcja hałasu jest wyśmienita, bardzo fajnie wygłusza otoczenie nawet jeśli nie słucha się muzyki, nie ma się nic włączonego, ja często korzystam z tego w pracy ponieważ mamy dość głośną produkcję. Dodatkowo wykrywanie rozmów jest niesamowite, kiedy tylko zaczyna się rozmawiać to dźwięk w słuchawkach automatycznie się zatrzymuje i nie trzeba manualnie wyciągać telefonu żeby stopować muzykę /podcast/ film. \nWszystkim którzy rozważają bardzo polecam, naprawdę nigdy nie miałam tak dobrych słuchawek. Jak na użytek przeciętnego użytkownika który głównie słucha podcastów, ogląda dużo YouTube, słucha czasem Tidala to jestem bardzo zadowolona. \nJedyny minus to że etui szybko się rysuje, ale można za grosze dokupić etui silikonowe i jest problem z głowy",
                "pros": "jakość dźwięku, jakość wykonania, redukcja szumów, szybkość ładowania, wygląd, wygoda używania",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-02-19 08:36:40",
                "purchase_date": "2024-02-14 14:40:00"
            },
            {
                "opinion_id": "18748249",
                "author": "k...7",
                "recommendation": "Polecam",
                "score": 4.0,
                "content": "Zakupione w sklepie abfoto.pl, ale nie jest to autoryzowany dystrybutor Apple i były problemy z datą gwarancji. Zamiast modelu MTJV3ZM/A otrzymałem MTJV3AM/A przez co na pudełku i słuchawkach są niestandardowe oznaczenia.",
                "pros": "jakość dźwięku, jakość wykonania, redukcja szumów, szybkość ładowania, wygląd, wygoda używania",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-06-19 20:22:58",
                "purchase_date": "2024-05-20 10:43:01"
            },
            {
                "opinion_id": "18839454",
                "author": "p...i",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Cena jest jaka jest, długo zastanawiałem się nad tym zakupem. Ilekroć kursor mojej myszki wędrował nad \"dodaj do koszyka\" jednak docierało do mnie: czy na pewno ich potrzebuję? Na co mi te słuchawki? Przecież i tak za dużo w nich nie słucham, tyle co na spacerach.\n\nNo i jak to zwykle bywa, jak to było też z Iphonem, w końcu myśli nie zdążyły na czas, a kursor zrobił swoje. \nI dobrze się stało.\nJakość produktu jest niezaprzeczalna i imponująca, zwłaszcza tryb wygłuszania dźwięków otoczenia - nie mam pojęcia jak on działa, ale działa bez wątpienia świetnie. Do tego stopnia, że mając słuchawki w uszach, aktywne wygłuszanie i stojąc przed kimś, kto do mnie mówi, głośność jego mowa zredukowana jest do maksymalnie 20% normalnej głośności.\n\nSama jakość odtwarzanego dźwięku również nie daje mi powodu, by coś jej zarzucić, jednak nie zdziwiło mnie to zbytnio. Dotychczas najdroższe słuchawki do telefonu jakie miałem w uszach, kosztowały maks 70 zł. Nie dziwota, że takie za 1000 zł są lepsze. \n\nNie żałuję zakupu i polecam każdemu, w kogo życiu ten zakup znajduje uzasadnienie.",
                "pros": "jakość dźwięku, jakość wykonania, ładowanie megasafe, redukcja szumów, szybkość ładowania, wygląd, wygoda używania",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-07-26 09:47:59",
                "purchase_date": "2024-07-21 16:30:54"
            },
            {
                "opinion_id": "18860545",
                "author": "Kuba",
                "recommendation": "Polecam",
                "score": 4.0,
                "content": "Oczekiwałem lepszego dźwięku po tych słuchawkach, zważywszy na wysoką cenę. Są one porównywane do Marshall'i MOTIF II ANC (które też posiadam), że generują bardzo podobny dźwięk - niestety nie jest to do końca prawda - są gorsze, szczególnie w zakresie wysokich tonów, które są ważne w odsłuchu. Długo by pisać, ale ogólnie dźwięk jest bardzo dobry, ale nie wyjątkowy - jeśli ktoś lubi bas i środkowe częstotliwości, to będzie super zadowolony. Czym naprawdę zaskakują to jakością wyciszania otoczenia, jak również trybem transparentnym - niesamowicie to działa (dużo lepiej niż w Marshall'ach MOTIF II ANC). Do tego obsługa AirPodsów dużo lepsza. Podsumowując: jeśli komuś zależy wyłącznie na super dźwięku, to wybrałbym Marshall'e (które dodatkowo mają dobrą firmową aplikację), jeśli natomiast na dodatkowych funkcjach, ale też z bardzo dobrym dźwiękiem - zdecydowanie AirPodsy Pro 2. Różnica w cenie jest znacząca, więc warto się zastanowić: 650-700 zł a 1050 zł to przepaść. Do tego AirPods'y mają białe gumki do uszu, a nie czarne jak w Marshallach, więc częściej trzeba je czyścić, żeby dobrze wyglądały. Polecam i pozdrawiam.",
                "pros": "bardzo wygodne, jakość wykonania, redukcja szumów, szybkość ładowania, wygląd, wygoda używania",
                "cons": "brak equalizera, jakość dźwięku",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-08-05 09:00:15",
                "purchase_date": "2024-07-23 09:15:55"
            },
            {
                "opinion_id": "18780788",
                "author": "j...s",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "bardzo dobra jakosc dzwieku, swietne sterowanie (wreszcie to odpowiednie naciskanie paneli wykonuje oczekiwane, a nie losowe czynnosci), fantastyczne przelaczanie miedzy urzedzniami apple (nie probowalem dzialac z urzadzeniami spoza apple). dobre wyciszenie przy ANC.\nMialem odrobione klopotu z dobreniem wielkosci gumek - standardowe byly dosc niewygodne (nieprzyjemne cisnienie w uszach, ale swietnie wygluszaja; mniejsze - sa super wygodne ale nie maja tak swietnego wygluszenia; rozmiar L - mieszanka powyzszych, ale po godzinie staja sie niewygodne). gdyby ktos nie odnalazl sie w tych rozmiarach albo ANC bylo by szczegolnie wazne - mozna probowac alternatywnych gumek produkowanych przez innych producentow.\n\nogolnie badzo fajne sluchawki, z troche 'nadmuchana' cena (apple...), ale po prostu bierzesz, dobierasz rozmiar gumek i dzialaja tak jak powinny, nie frustruja przy sterowaniu, nie wypadaja z uszu i przyjemnie odcinaja od otoczenia.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-07-03 08:46:23",
                "purchase_date": "2024-06-20 20:48:13"
            },
            {
                "opinion_id": "19130301",
                "author": "l...5",
                "recommendation": "Polecam",
                "score": 4.5,
                "content": "Pierwszorzędne wykonanie. Słuchawki nic sobie nie robią z upadku na twardą powierzchnię. Funkcja wyciszania hałasu - genialna; można używać do spania w głośnym środowisku zamiast zatyczek. Charakterystyka pasma poprawna, choć wiadomo, że przy takich pchełkach głębokiego basu nie ma się co spodziewać. \nSą odporne na pot a raz jedna wpadła mi do umywalki pod strumień wody i nic złego się nie stało. \nŁadują się szybciej, niż oczekiwałem.",
                "pros": "jakość dźwięku, jakość wykonania, redukcja szumów, szybkość ładowania, wygląd, wygoda używania",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-10-14 11:20:56",
                "purchase_date": "2024-09-12 19:44:09"
            },
            {
                "opinion_id": "18809395",
                "author": "k...1",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Lekkie, dobrze leżą w uszach, pierwsze, które nie wypadają z moich uszu (co było koszmarem). Idealnie współpracują w ekosystemie Apple. ANC działa bardzo dobrze, wreszcie mogę czegoś posłuchać wykonując inne domowe czynności (np. odkurzanie wycina idealnie). Dźwięk bardzo dobry, mi trochę brakuje wyostrzenia, ale to indywidualne preferencje. Osobiście wolę tryb przestrzenny, wtedy dają z siebie więcej.",
                "pros": "None",
                "cons": "redukcja szumów, wygląd, wygoda używania",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-07-15 08:08:11",
                "purchase_date": "2024-07-02 11:21:00"
            },
            {
                "opinion_id": "17115940",
                "author": "s...9",
                "recommendation": "Polecam",
                "score": 4.5,
                "content": "To nie są słuchawki dla audiofila. Takie zdanie zapewne odpędzi sporą część osób rozglądających się za dousznym sprzętem audio, ale nie ma co sie zrażać. Zdecydowanie nadrabiają komfortem użytkowania, łatwością i przyjemnością obsługi oraz świetną synchronizacją z produktami Apple wszelkiej maści. Wracając do początku mojej opinii - owszem, nie odkryjecie tutaj siódmego wymiaru doznań słuchowych, ale to wciąż prześwietne jakościowo słuchawki. Wysokie tony genialne, niskie również, środkowa scena spełnia moje półaudiofilskie oczekiwania w 100%. Zapewniam, że z zakupu trudno jest być niezadowolonym. Warunek jest taki, że nie kupujemy ich tylko dla dźwięku.",
                "pros": "jakość dźwięku, redukcja szumów, wygląd, wygoda używania",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2023-02-07 21:42:05",
                "purchase_date": "2023-01-23 07:30:41"
            },
            {
                "opinion_id": "18527095",
                "author": "p...i",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Jestem bardzo zadowolony ze słuchawek. Wiadomo - rzecz gustu. Dla mnie spełniają swoją funkcję - bardzo dobrej jakości dźwięk przy słuchaniu muzyki, bardzo dobrze się przez nie rozmawia, funkcja ANC wygłusza niesamowicie - można się dosłownie odciąć od otoczenia.\nPOLECAM",
                "pros": "jakość dźwięku, jakość wykonania, redukcja szumów, szybkość ładowania, wygląd, wygoda używania",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-03-26 21:22:11",
                "purchase_date": "2024-03-13 00:25:57"
            },
            {
                "opinion_id": "18289270",
                "author": "s...8",
                "recommendation": "Polecam",
                "score": 5.0,
                "content": "Słuchawki grają bardzo poprawnie dźwięk jest zrównoważony w związku z tym wielbiciel basu będą zawiedzeni. Inne marki oferują dźwięk w podobnej jakości ale o połowę niższej cenie jednak te słuchawki bardzo dobrze współpracują z telefonem Apple oferując dodatkowe funkcje.",
                "pros": "jakość dźwięku, redukcja szumów, wygląd, wygoda używania",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-01-10 11:35:03",
                "purchase_date": "2024-01-05 15:27:57"
            }
        ]
    }
]