[
    {
        "product_id": "99105003",
        "name": "Laptop Apple MacBook Air 13,3\"/M1/8GB/256GB/macOS (MGN63ZEA)",
        "reviews": [
            {
                "opinion_id": "19043025",
                "author": "Unknown",
                "recommendation": "",
                "score": 0.0,
                "content": "Laptop Apple MacBook Air M1 cieszy si wysokim uznaniem wr贸d u偶ytkownik贸w, kt贸rzy chwal jego lekko, szybko dziaania oraz wysok jako wykonania. U偶ytkownicy doceniaj tak偶e dugi czas pracy na baterii oraz zgranie z innymi produktami Apple. Mimo pewnych ogranicze wynikajcych z braku standardowych port贸w, og贸lne wra偶enie jest bardzo pozytywne.",
                "pros": "Wydajno, Jako wykonania, Dugi czas pracy na baterii, Intuicyjno obsugi, Wsp贸praca z innymi urzdzeniami Apple",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "",
                "purchase_date": ""
            },
            {
                "opinion_id": "14268101",
                "author": "s...3",
                "recommendation": "",
                "score": 5.0,
                "content": "Laptop jest perfekcyjny, tylko nie za bardzo mi pasuje pod wzgldem in偶ynierskich program typu Autocad, Robot itd.\nJak kupujecie go w celu pracy w tych programach to bdzie nie najlepszy pomys ze kupowa ten laptop. We wszystkim innym nie mog si nacieszy - szybki, lekki, nie nagrzewa si, cichy i pikny :)",
                "pros": "audio (dolby, bateria, jako, wydajno, wygld",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-10 18:42:54",
                "purchase_date": "2021-03-10 22:32:01"
            },
            {
                "opinion_id": "15147658",
                "author": "b...1",
                "recommendation": "",
                "score": 4.5,
                "content": "Za t cen - nie ma r贸wnych na rynku. \nPerfekcyjnie wykoczony design, bezkonkurencyjny procesor(wietnie radzi sobie ze wszystkimi wymaganiami, osobicie dla mnie, w marketingu i reklamie), dobry experience.\nPolecam od caego serca!",
                "pros": "bateria, jako, wydajno, wygld",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-10-30 17:23:04",
                "purchase_date": "2021-09-30 07:32:20"
            },
            {
                "opinion_id": "14228418",
                "author": "s...e",
                "recommendation": "",
                "score": 5.0,
                "content": "Jako wykonania na najwy偶szym poziomie, pojemna bateria, ka偶dego dnia u偶ywam go nonstop w godzinach 12-16. Du偶y gadzik dziki kt贸remu nie ma potrzeby kupowania myszki, jakosc audio rowniez na wysokim poziomie, pisanie sprawia przyjemno",
                "pros": "audio (dolby, bateria, jako, wydajno, wygld",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-04 00:45:49",
                "purchase_date": "2021-03-17 10:32:40"
            },
            {
                "opinion_id": "13786487",
                "author": "Tomasz",
                "recommendation": "",
                "score": 5.0,
                "content": "Jeszcze przed Sylwestrem 2020 kupiem nowy model MacBooka Air (szary z 16GB RAM). Na dostaw z Cortland czekaem tylko tydzie, mo偶e miaem szczcie. Jest naprawd adny (zwaszcza wywietlacz w por贸wnaniu ze starym MacBookiem Air z 2015), jako wykonania aluminiowej obudowy, bardzo wygodna podwietlana klawiatura (chocia偶 przyzwyczaiem si do wikszego skoku klawiszy), wielki i precyzyjny gadzik (warto nauczy si obsugi gest贸w, jak np. przewijanie stron 2 palcami) - s w tym modelu bez zarzutu.  D藕wik tak偶e bardzo dobry, czysty i znacznie goniejszy ni偶 w ASUSie ZenBook sprzed paru lat. Szkoda, 偶e nie da si na nowym MacBooku zainstalowa systemu Windows na wydzielonej partycji (podobno da si na maszynie wirtualnej Parallels). Minusem jest mao port贸w (tylko 2 USB typu C, w tym do adowania, i wyjcie na suchawki) oraz brak czytnika kart pamici (w starym modelu pozwala tanio zwikszy pami na pliki). Spraw zaatwia zgrabny kwadratowy hub od GreenCella (mo偶e lepiej nie podcza przez niego adowania, chocia偶 mo偶na, ale myszki, dyski zewntrzne na USB i wyjcie HDMI na zewntrzny monitor - dziaaj). Nie wykorzystywaem dotd bardzo obci偶ajcych system program贸w (typu Final Cut Pro), ale aplikacje systemowe (Zdjcia, Muzyka, Safari) oraz inne czsto u偶ywane (Microsoft *****, PowerPoint, Excel, Adobe Reader czy Google Chrome) uruchamiaj si bardzo szybko a laptop dziaa bez szumu wentylator贸w (kt贸rych brak) i czasami jest tylko troch cieplejszy... Wbrew narzekaniom paru youtuber贸w, obraz z kamerki nawet starego MacBooka Air z 2015 by adny, jasny i wyra藕ny w por贸wnaniu z innymi uczestnikami lekcji online (aplikacja Teams na MacOS). W nowym modelu jest oczywicie nie gorsza kamera ni偶 w starym. Bateria starcza na 10 godzin pracy czy nawet wicej (przy przyciemnionym wywietlaczu i bez wi-fi). System operacyjny MacOS 11 Big Sur jest intuicyjny w obsudze, adny graficznie i stabilny (wietnie sprawdza si np. Time Machine). W og贸le nie gram na komputerze, wic na dostpnoci najnowszych gier w sklepie AppStore mi nie zale偶y. Jako wieloletni u偶ytkownik Windows贸w wszelakich nie mogem jednak przyzwyczai si do paru r贸偶nic obu system贸w, jak brak na klawiaturze MacBooka Delete, od razu te偶 przestawiem miejscami klawisze Command i Option, aby wygodniej wstawia w tekcie polskie znaki. Gesty gadzika dopiero poznaj, wol u偶ywa zewntrznej myszki, a to jest dosy kopotliwe, bo wymaga adaptera USB C na USB 3.1 albo myszki na Bluetooth. Mo偶e z czasem zainwestuj w nowsz mysz, np. od Apple...",
                "pros": "bateria, jako, wydajno, wygld",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-01-17 11:26:10",
                "purchase_date": ""
            },
            {
                "opinion_id": "14313169",
                "author": "k...k",
                "recommendation": "",
                "score": 5.0,
                "content": "Jako u偶ytkownik systemu windows i laptop贸w/komputer贸w na nim opartych od wielu lat musz powiedzie, 偶e jako wykonania tej maszyny to wrcz definicja produktu premium. Aluminiowa obudowa, kt贸ra si nie w og贸le nie nagrzewa, laptop nie wydaje 偶adnych d藕wik贸w a system miga jak torpeda. Co prawda przyzwyczajenie si do tego, jak pewne rzeczy s konfigurowane/wykorzystywane w MacOS troch mo偶e zaj po latach innych nawyk贸w ale pierwsze wra偶enie jest jest piorunujce. Nigdy nie widziaem tak wysokiej jakoci obrazu na ekranie laptopa, 偶yletka. A te kolory... Goniki te偶 spoko, maj nawet zauwa偶aln gbi co jest dziwnym biorc pod uwag jak drobny jest to sprzt. Jedyny minus jaki w zasadzie zauwa偶yem to spore ramki wok贸 ekranu, kt贸rych w laptopach premium na Windowsie nie ma ju偶 od paru lat.",
                "pros": "audio (dolby, bateria, jako, wydajno, wygld",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-18 20:07:28",
                "purchase_date": "2021-04-13 23:01:00"
            },
            {
                "opinion_id": "15390962",
                "author": "v...a",
                "recommendation": "",
                "score": 5.0,
                "content": "Super cienki i Super wykonanie! super bateria  i szybkosc wiecej mi nie trzeba :)",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-12-18 09:52:14",
                "purchase_date": "2021-12-05 10:08:38"
            },
            {
                "opinion_id": "14371486",
                "author": "z...p",
                "recommendation": "",
                "score": 5.0,
                "content": "Mac, nic doda nic uj. Sprzt wykonuje komendy w mgnieniu oka, pikny gboki obraz z inteligentnym systemem przechodzenia w tryb nocny (mo偶na oczywicie wyczy) pot偶na bateria, fantastyczny, gboki d藕wik z usadowionych obok klawiatury goniczk贸w, czno z internetem po wifi niezawodna, mikrofon wietnie zbiera, kamera internetowa mogaby by lepsza, bo w por贸wnaniu z iPhonem prezentuje si licho, ale standard jest wci偶 profesjonalny.\nMinusy - brak standardowych wej, od razu trzeba kupi adapter dla wszystkich potrzebnych narzdzi, SD USB HDMI itd.",
                "pros": "None",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-28 10:22:44",
                "purchase_date": "2021-04-16 17:00:40"
            },
            {
                "opinion_id": "13816722",
                "author": "m...c",
                "recommendation": "",
                "score": 5.0,
                "content": "To m贸j pierwszy MacBook. Decyzj o zmianie komputera osobistego z windowsem na komputer z MacOS podjem przy okazji kilkumiesicznego u偶ytkowania flagowego smartfona z androidem i powrocie do iPhone. \nDostp do plik贸w, multimedi贸w i danych jest rewelacyjny w poczeniu z iCloud.\nMacbook Air M1 jest wykonany z bardzo dobrej jakoci materia贸w. Jest cakowicie bezgony (nie posiada wentylator贸w) a przy tym bardzo chodny. Uwa偶am, 偶e jego cena jest adekwatna do tego co oferuje.\nPolecam.",
                "pros": "bateria, jako, wydajno, wygld",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-01-21 20:31:49",
                "purchase_date": "2021-01-12 22:35:45"
            },
            {
                "opinion_id": "14327419",
                "author": "d...h",
                "recommendation": "",
                "score": 5.0,
                "content": "Sprzt idealny",
                "pros": "audio (dolby, bateria, jako, wydajno, wygld",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2021-04-21 07:15:46",
                "purchase_date": "2021-04-06 23:09:40"
            },
            {
                "opinion_id": "18701569",
                "author": "e...z",
                "recommendation": "",
                "score": 3.0,
                "content": "To m贸j pierwszy  kontakt  z produktem firmy Apple. Tak jak czytaem o jakoci  d藕wiku i obrazu  ,intuicyjnoci  systemu tak faktycznie  byem  mile zaskoczony. Nie mniej nie obyo si bez moment贸w  rozczarowania.Amatorsko zajmuj  si  fotografi  i niestety tutaj zaczynaj si schody.\nNiekt贸rych  program贸w  do obr贸bki  zdj  nie mo偶na  wgra. Ogldanie wasnych  film贸w  video z wakacji na tv z androidem poprostu  nie odtworzysz.Zdarza si,  偶e Macbook si zawiesza i mocno grzeje. M贸wic  wprost  super gad偶ety  to ogldania film贸w z aplikacji, suchani muzyki, przegldania stron ale nie dla amatora fotografii.",
                "pros": "bateria, jako, wydajno, wygld",
                "cons": "None",
                "helpful": 0,
                "unhelpful": 0,
                "publish_date": "2024-06-03 12:00:41",
                "purchase_date": "2024-04-02 21:08:22"
            }
        ]
    }
]